v7idea/chip-pump-cp8000/arduino/hardware/chippump/cp8000/boards.txt
menu.boot=Boot Target
menu.log=SDK Log
menu.blelog=Vendor BLE Log
menu.ota=OTA Mode
menu.autoreset=Auto Upload Reset

cp8001_sop16.name=CP81-Mini

cp8001_sop16.upload.tool=cp8000-uploader
cp8001_sop16.upload.protocol=cp8000-uart
cp8001_sop16.upload.maximum_size=262144
cp8001_sop16.upload.maximum_data_size=13824
cp8001_sop16.upload.speed=default
cp8001_sop16.upload.target=flash
cp8001_sop16.upload.app_reset_mode=auto

cp8001_sop16.bootloader.tool=cp8000-uploader
cp8001_sop16.bootloader.file=

cp8001_sop16.build.mcu=e902m
cp8001_sop16.build.f_cpu=48000000L
cp8001_sop16.build.board=CP8001_SOP16
cp8001_sop16.build.core=cp8000
cp8001_sop16.build.variant=cp8001_sop16
cp8001_sop16.build.flash_base=0x10000000
cp8001_sop16.build.linker=cp800x_ble2g4_app.ld
cp8001_sop16.build.extra_flags=-DARDUINO_CP8001_SOP16 -DCP8000_FLASH_BASE={build.flash_base} {build.ota_flags} {build.auto_reset_flags}
cp8001_sop16.build.ota_flags=-DBLE_FOTA_EN=0 -DOTA_BOOT_EN=0
cp8001_sop16.build.auto_reset_flags=-DCP8000_AUTO_UPLOAD_RESET=1
cp8001_sop16.build.sdk_libs=-lstartlib -lblebase -lblestack -l2g4_base -lrf2g4

cp8001_sop16.menu.boot.flash=Flash
cp8001_sop16.menu.boot.flash.upload.target=flash

cp8001_sop16.menu.boot.otp=OTP
cp8001_sop16.menu.boot.otp.upload.target=otp
cp8001_sop16.menu.boot.otp.build.flash_base=0x1F800000
cp8001_sop16.menu.boot.otp.build.linker=cp800x_2g4_otp.ld

cp8001_sop16.menu.log.enabled=Enabled
cp8001_sop16.menu.log.enabled.build.log_flags=
cp8001_sop16.menu.log.disabled=Disabled
cp8001_sop16.menu.log.disabled.build.log_flags=

cp8001_sop16.menu.blelog.disabled=Disabled
cp8001_sop16.menu.blelog.disabled.build.vendor_ble_log_flags=-DCP8000_VENDOR_BLE_LOG_ENABLED=0
cp8001_sop16.menu.blelog.enabled=Enabled
cp8001_sop16.menu.blelog.enabled.build.vendor_ble_log_flags=-DCP8000_VENDOR_BLE_LOG_ENABLED=1

cp8001_sop16.menu.autoreset.enabled=Enabled
cp8001_sop16.menu.autoreset.enabled.build.auto_reset_flags=-DCP8000_AUTO_UPLOAD_RESET=1
cp8001_sop16.menu.autoreset.enabled.upload.app_reset_mode=auto
cp8001_sop16.menu.autoreset.disabled=Disabled
cp8001_sop16.menu.autoreset.disabled.build.auto_reset_flags=-DCP8000_AUTO_UPLOAD_RESET=0
cp8001_sop16.menu.autoreset.disabled.upload.app_reset_mode=disabled

cp8001_sop16.menu.ota.disabled=Disabled
cp8001_sop16.menu.ota.disabled.build.ota_flags=-DBLE_FOTA_EN=0 -DOTA_BOOT_EN=0
cp8001_sop16.menu.ota.device=BLE OTA Device App
cp8001_sop16.menu.ota.device.build.ota_flags=-DBLE_FOTA_EN=1 -DOTA_BOOT_EN=0
cp8001_sop16.menu.ota.device.build.flash_base=0x10001000
cp8001_sop16.menu.ota.device.build.linker=cp800x_ble_ota.ld
cp8001_sop16.menu.ota.device.upload.maximum_data_size=16384
cp8001_sop16.menu.ota.bootloader=BLE OTA Bootloader
cp8001_sop16.menu.ota.bootloader.build.ota_flags=-DBLE_FOTA_EN=0 -DOTA_BOOT_EN=1
cp8001_sop16.menu.ota.bootloader.build.flash_base=0x10000000
cp8001_sop16.menu.ota.bootloader.build.linker=cp800x_bootload.ld
cp8001_sop16.menu.ota.bootloader.build.sdk_libs=-lstartlib
cp8001_sop16.menu.ota.bootloader.upload.maximum_data_size=16384
